app/controllers/books_controller.rb

  def index
    @books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def update
    @book = Book.find(params[:id])
    @book.user_id = current_user.id
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "a"], ["body", "su"], ["updated_at", "2019-01-30 06:12:38.542796"], ["id", 2]]

  def destroy
    book = Book.find(params[:id])
    if book.delete
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 5]]

  def correct_user
  book = current_user.books.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]