app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" DESC  [["user_id", 1]]
---
def show
  	@user = User.find(params[:id])
  	@book = Book.new
	@books = @user.books.all.order(created_at: :desc)

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
def index
  @users = User.all.order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def correct_user
    user = User.find(params[:id])