app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "鈴木"], ["LIMIT", 1]]
---
      def self.find_first_by_auth_conditions(warden_conditions)
	    conditions = warden_conditions.dup
	    if login = conditions.delete(:login)
	      where(conditions).where(["name = :value", { :value => name }]).first